{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Laboratorio 04 | The Games of Nodes Part II\n",
    "\n",
    "Agregaciones en Neo4j (Cypher) usando Count, Collect y Size\n",
    "\n",
    "## Configuración del entorno"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from dotenv import load_dotenv\n",
    "import os\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [],
   "source": [
    "load_dotenv()\n",
    "\n",
    "URI = os.getenv(\"NEO4J_URI\")\n",
    "AUTH = (os.getenv(\"NEO4J_USERNAME\"), os.getenv(\"NEO4J_PASSWORD\"))\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "\n",
    "def close_connection():\n",
    "    driver.close()\n",
    "\n",
    "def verify_connection():\n",
    "    try:\n",
    "        driver.verify_connectivity()\n",
    "        print(\"Connection verified\")\n",
    "        with driver.session() as session:\n",
    "            result = session.run(\"RETURN 1 AS value\")\n",
    "            value = result.single()[\"value\"]\n",
    "            print(\"Connection successful. Result:\", value)\n",
    "    except Exception as e:\n",
    "        print(\"Connection failed:\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Verificar la conexión"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connection verified\n",
      "Connection successful. Result: 1\n"
     ]
    }
   ],
   "source": [
    "verify_connection()\n",
    "# close_connection()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## **Acto 1: El Descenso de los Cineastas**"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### **Investigación 1:** Determinar la cantidad de cineastas antes y después de 2010\n",
    "- **Objetivo:** Determinar cuántos cineastas han ingresado a la industria antes y después del 2010."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Cineastas antes de 2010: 6\n",
      "Cineastas después de 2010: 4\n"
     ]
    }
   ],
   "source": [
    "def get_arround_2010():\n",
    "  query1 = \"\"\"\n",
    "    MATCH (p:Person)\n",
    "    WHERE p.yearJoined < 2010\n",
    "    RETURN COUNT(p) AS CineastasAntes\n",
    "  \"\"\"\n",
    "  query2 = \"\"\"\n",
    "    MATCH (p:Person)\n",
    "    WHERE p.yearJoined >= 2010\n",
    "    RETURN COUNT(p) AS CineastasDespues\n",
    "  \"\"\"\n",
    "  with driver.session() as session:\n",
    "    result1 = session.run(query1)\n",
    "    cineastas_antes = result1.single()[\"CineastasAntes\"]\n",
    "    \n",
    "    result2 = session.run(query2)\n",
    "    cineastas_despues = result2.single()[\"CineastasDespues\"]\n",
    "    \n",
    "    return cineastas_antes, cineastas_despues\n",
    "\n",
    "cineastas_antes_2010, cineastas_despues_2010 = get_arround_2010()\n",
    "print(\"Cineastas antes de 2010:\", cineastas_antes_2010)\n",
    "print(\"Cineastas después de 2010:\", cineastas_despues_2010)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### **Investigación 2:** Analizar los cambios en la industria con base en los géneros\n",
    "- **Objetivo:** Investigar los cambios en la industria que podrían estar relacionados con los géneros de las películas. Uso de COUNT()."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Genero</th>\n",
       "      <th>NumPeliculas</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Drama</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Acción</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Suspenso</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Ciencia Ficción</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Terror</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Comedia</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Genero  NumPeliculas\n",
       "0            Drama             6\n",
       "1           Acción             6\n",
       "2         Suspenso             5\n",
       "3  Ciencia Ficción             4\n",
       "4           Terror             3\n",
       "5          Comedia             1"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_movie_genres_count():\n",
    "  query = \"\"\"\n",
    "  MATCH (m:Movie)-[:BELONGS_TO]->(g:Genre)\n",
    "  RETURN g.name AS Genero, COUNT(m) AS NumPeliculas\n",
    "  ORDER BY NumPeliculas DESC\n",
    "  \"\"\"\n",
    "  with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    genres_count = [{\"Genero\": record[\"Genero\"], \"NumPeliculas\": record[\"NumPeliculas\"]} for record in result]\n",
    "    return genres_count\n",
    "\n",
    "movie_genres_count = get_movie_genres_count()\n",
    "\n",
    "df_movie_genres_count = pd.DataFrame(movie_genres_count)\n",
    "df_movie_genres_count"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "###  **Investigación 3:** ¿Cómo ha afectado la disminución de cineastas a las colaboraciones?\n",
    "- Objetivo: Investigar si la disminución de cineastas ha afectado la colaboración dentro de la comunidad. Uso de COUNT()."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Colaboraciones entre cineastas: 9\n"
     ]
    }
   ],
   "source": [
    "def get_collaborations_count():\n",
    "  query = \"\"\"\n",
    "  MATCH (p:Person)-[:COLLABORATED_WITH]->(colleague)\n",
    "  RETURN COUNT(DISTINCT p) AS CineastasColaborando\n",
    "  \"\"\"\n",
    "  with driver.session() as session:\n",
    "    result = session.run(query)\n",
    "    collaborations_count = result.single()[\"CineastasColaborando\"]\n",
    "    return collaborations_count\n",
    "\n",
    "collaborations_count = get_collaborations_count()\n",
    "print(\"Colaboraciones entre cineastas:\", collaborations_count)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    ">Pista revelada: Las colaboraciones han aumentado, lo que sugiere que la comunidad cinematográfica es más unida y competitiva que antes."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## **Acto 2: Los Vínculos Ocultos**"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### **Investigación 4:** Agrupar cineastas por año de unión\n",
    "\n",
    "- Objetivo: Ver tendencias en la adhesión de nuevos cineastas a lo largo del tiempo.  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>AñoIngreso</th>\n",
       "      <th>Cineastas</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1985</td>\n",
       "      <td>[Roberto Díaz]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1990</td>\n",
       "      <td>[Juan Pérez]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1998</td>\n",
       "      <td>[Alejandro González]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2000</td>\n",
       "      <td>[Carlos Méndez]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2003</td>\n",
       "      <td>[Sofia Ramírez]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>2005</td>\n",
       "      <td>[Laura Fernández]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>2010</td>\n",
       "      <td>[Carla Mendoza]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>2012</td>\n",
       "      <td>[Elena Gutiérrez]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>2015</td>\n",
       "      <td>[Miguel Torres]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>2018</td>\n",
       "      <td>[Valeria Soto]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   AñoIngreso             Cineastas\n",
       "0        1985        [Roberto Díaz]\n",
       "1        1990          [Juan Pérez]\n",
       "2        1998  [Alejandro González]\n",
       "3        2000       [Carlos Méndez]\n",
       "4        2003       [Sofia Ramírez]\n",
       "5        2005     [Laura Fernández]\n",
       "6        2010       [Carla Mendoza]\n",
       "7        2012     [Elena Gutiérrez]\n",
       "8        2015       [Miguel Torres]\n",
       "9        2018        [Valeria Soto]"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_cineastas_por_ano():\n",
    "    query = \"\"\"\n",
    "    MATCH (p:Person)\n",
    "    RETURN p.yearJoined AS AñoIngreso, COLLECT(p.name) AS Cineastas\n",
    "    ORDER BY AñoIngreso\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        cineastas_por_ano = [{\"AñoIngreso\": record[\"AñoIngreso\"], \"Cineastas\": record[\"Cineastas\"]} for record in result]\n",
    "        return cineastas_por_ano\n",
    "\n",
    "cineastas_por_ano = get_cineastas_por_ano()\n",
    "\n",
    "df_cineastas_por_ano = pd.DataFrame(cineastas_por_ano)\n",
    "df_cineastas_por_ano"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### **Investigación 5:** Identificar las películas dirigidas por cada cineasta\n",
    "\n",
    "- Objetivo: Coleccionar los títulos de películas dirigidas por cada cineasta.  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Director</th>\n",
       "      <th>PeliculasDirigidas</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Alejandro González</td>\n",
       "      <td>[El Último Acto, Destino Inesperado]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Sofia Ramírez</td>\n",
       "      <td>[Ciudad Oscura, Sueños Rotos]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Juan Pérez</td>\n",
       "      <td>[Fuego Interno, Horizonte Perdido, Más Allá de...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Carla Mendoza</td>\n",
       "      <td>[Sin Retorno, El Último Refugio]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Miguel Torres</td>\n",
       "      <td>[Caos Total, Código Secreto]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Laura Fernández</td>\n",
       "      <td>[Fantasmas del Pasado, Caminos Cruzados]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Roberto Díaz</td>\n",
       "      <td>[Guerra de Titanes, El Silencio Mortal, El Fin...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Elena Gutiérrez</td>\n",
       "      <td>[Dimensión Desconocida, La Verdad Prohibida]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Carlos Méndez</td>\n",
       "      <td>[El Espejo Roto, Lágrimas en el Viento, Colapso]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Director                                 PeliculasDirigidas\n",
       "0  Alejandro González               [El Último Acto, Destino Inesperado]\n",
       "1       Sofia Ramírez                      [Ciudad Oscura, Sueños Rotos]\n",
       "2          Juan Pérez  [Fuego Interno, Horizonte Perdido, Más Allá de...\n",
       "3       Carla Mendoza                   [Sin Retorno, El Último Refugio]\n",
       "4       Miguel Torres                       [Caos Total, Código Secreto]\n",
       "5     Laura Fernández           [Fantasmas del Pasado, Caminos Cruzados]\n",
       "6        Roberto Díaz  [Guerra de Titanes, El Silencio Mortal, El Fin...\n",
       "7     Elena Gutiérrez       [Dimensión Desconocida, La Verdad Prohibida]\n",
       "8       Carlos Méndez   [El Espejo Roto, Lágrimas en el Viento, Colapso]"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_peliculas_dirigidas():\n",
    "    query = \"\"\"\n",
    "    MATCH (p:Person)-[:DIRECTED]->(m:Movie)\n",
    "    RETURN p.name AS Director, COLLECT(m.title) AS PeliculasDirigidas\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        peliculas_dirigidas = [{\"Director\": record[\"Director\"], \"PeliculasDirigidas\": record[\"PeliculasDirigidas\"]} for record in result]\n",
    "        return peliculas_dirigidas\n",
    "\n",
    "peliculas_dirigidas = get_peliculas_dirigidas()\n",
    "\n",
    "df_peliculas_dirigidas = pd.DataFrame(peliculas_dirigidas)\n",
    "df_peliculas_dirigidas"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### **Investigación 6:** Agrupar películas por género y director\n",
    "\n",
    "- Objetivo: Entender cómo los directores han diversificado su producción.  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Director</th>\n",
       "      <th>Genero</th>\n",
       "      <th>Peliculas</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Alejandro González</td>\n",
       "      <td>Drama</td>\n",
       "      <td>[El Último Acto]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Alejandro González</td>\n",
       "      <td>Acción</td>\n",
       "      <td>[Destino Inesperado]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Carla Mendoza</td>\n",
       "      <td>Suspenso</td>\n",
       "      <td>[Sin Retorno]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Carla Mendoza</td>\n",
       "      <td>Drama</td>\n",
       "      <td>[El Último Refugio]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Carlos Méndez</td>\n",
       "      <td>Terror</td>\n",
       "      <td>[El Espejo Roto]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Carlos Méndez</td>\n",
       "      <td>Drama</td>\n",
       "      <td>[Lágrimas en el Viento]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Carlos Méndez</td>\n",
       "      <td>Ciencia Ficción</td>\n",
       "      <td>[Colapso]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Elena Gutiérrez</td>\n",
       "      <td>Ciencia Ficción</td>\n",
       "      <td>[Dimensión Desconocida]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Elena Gutiérrez</td>\n",
       "      <td>Suspenso</td>\n",
       "      <td>[La Verdad Prohibida]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Juan Pérez</td>\n",
       "      <td>Acción</td>\n",
       "      <td>[Fuego Interno]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Juan Pérez</td>\n",
       "      <td>Ciencia Ficción</td>\n",
       "      <td>[Horizonte Perdido]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Juan Pérez</td>\n",
       "      <td>Terror</td>\n",
       "      <td>[Más Allá del Miedo]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Laura Fernández</td>\n",
       "      <td>Suspenso</td>\n",
       "      <td>[Fantasmas del Pasado]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Laura Fernández</td>\n",
       "      <td>Drama</td>\n",
       "      <td>[Caminos Cruzados]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Miguel Torres</td>\n",
       "      <td>Ciencia Ficción</td>\n",
       "      <td>[Caos Total]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Miguel Torres</td>\n",
       "      <td>Acción</td>\n",
       "      <td>[Código Secreto]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Roberto Díaz</td>\n",
       "      <td>Acción</td>\n",
       "      <td>[Guerra de Titanes, El Fin del Juego]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Roberto Díaz</td>\n",
       "      <td>Terror</td>\n",
       "      <td>[El Silencio Mortal]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Roberto Díaz</td>\n",
       "      <td>Suspenso</td>\n",
       "      <td>[Pánico en la Ciudad]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Sofia Ramírez</td>\n",
       "      <td>Suspenso</td>\n",
       "      <td>[Ciudad Oscura]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Sofia Ramírez</td>\n",
       "      <td>Drama</td>\n",
       "      <td>[Sueños Rotos]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              Director           Genero                              Peliculas\n",
       "0   Alejandro González            Drama                       [El Último Acto]\n",
       "1   Alejandro González           Acción                   [Destino Inesperado]\n",
       "2        Carla Mendoza         Suspenso                          [Sin Retorno]\n",
       "3        Carla Mendoza            Drama                    [El Último Refugio]\n",
       "4        Carlos Méndez           Terror                       [El Espejo Roto]\n",
       "5        Carlos Méndez            Drama                [Lágrimas en el Viento]\n",
       "6        Carlos Méndez  Ciencia Ficción                              [Colapso]\n",
       "7      Elena Gutiérrez  Ciencia Ficción                [Dimensión Desconocida]\n",
       "8      Elena Gutiérrez         Suspenso                  [La Verdad Prohibida]\n",
       "9           Juan Pérez           Acción                        [Fuego Interno]\n",
       "10          Juan Pérez  Ciencia Ficción                    [Horizonte Perdido]\n",
       "11          Juan Pérez           Terror                   [Más Allá del Miedo]\n",
       "12     Laura Fernández         Suspenso                 [Fantasmas del Pasado]\n",
       "13     Laura Fernández            Drama                     [Caminos Cruzados]\n",
       "14       Miguel Torres  Ciencia Ficción                           [Caos Total]\n",
       "15       Miguel Torres           Acción                       [Código Secreto]\n",
       "16        Roberto Díaz           Acción  [Guerra de Titanes, El Fin del Juego]\n",
       "17        Roberto Díaz           Terror                   [El Silencio Mortal]\n",
       "18        Roberto Díaz         Suspenso                  [Pánico en la Ciudad]\n",
       "19       Sofia Ramírez         Suspenso                        [Ciudad Oscura]\n",
       "20       Sofia Ramírez            Drama                         [Sueños Rotos]"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_peliculas_por_genero_y_director():\n",
    "    query = \"\"\"\n",
    "    MATCH (p:Person)-[:DIRECTED]->(m:Movie)-[:BELONGS_TO]->(g:Genre)\n",
    "    RETURN p.name AS Director, g.name AS Genero, COLLECT(m.title) AS Peliculas\n",
    "    ORDER BY Director\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        peliculas_por_genero_y_director = [{\"Director\": record[\"Director\"], \"Genero\": record[\"Genero\"], \"Peliculas\": record[\"Peliculas\"]} for record in result]\n",
    "        return peliculas_por_genero_y_director\n",
    "\n",
    "peliculas_por_genero_y_director = get_peliculas_por_genero_y_director()\n",
    "\n",
    "df_peliculas_por_genero_y_director = pd.DataFrame(peliculas_por_genero_y_director)\n",
    "df_peliculas_por_genero_y_director"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## **Acto 3: Evaluación de la Productividad**\n",
    "\n",
    "### **Investigación 7:** Contar cuántas películas ha dirigido cada cineasta\n",
    "- Objetivo: Medir la productividad de cada cineasta."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Director</th>\n",
       "      <th>NumPeliculasDirigidas</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Roberto Díaz</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Juan Pérez</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Carlos Méndez</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Alejandro González</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Sofia Ramírez</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Carla Mendoza</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Miguel Torres</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Laura Fernández</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Elena Gutiérrez</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Director  NumPeliculasDirigidas\n",
       "0        Roberto Díaz                      4\n",
       "1          Juan Pérez                      3\n",
       "2       Carlos Méndez                      3\n",
       "3  Alejandro González                      2\n",
       "4       Sofia Ramírez                      2\n",
       "5       Carla Mendoza                      2\n",
       "6       Miguel Torres                      2\n",
       "7     Laura Fernández                      2\n",
       "8     Elena Gutiérrez                      2"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_num_peliculas_dirigidas():\n",
    "    query = \"\"\"\n",
    "    MATCH (p:Person)-[:DIRECTED]->(m:Movie)\n",
    "    RETURN p.name AS Director, SIZE(COLLECT(m.title)) AS NumPeliculasDirigidas\n",
    "    ORDER BY NumPeliculasDirigidas DESC\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        num_peliculas_dirigidas = [{\"Director\": record[\"Director\"], \"NumPeliculasDirigidas\": record[\"NumPeliculasDirigidas\"]} for record in result]\n",
    "        return num_peliculas_dirigidas\n",
    "\n",
    "num_peliculas_dirigidas = get_num_peliculas_dirigidas()\n",
    "\n",
    "df_num_peliculas_dirigidas = pd.DataFrame(num_peliculas_dirigidas)\n",
    "df_num_peliculas_dirigidas"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### **Investigación 8:** Evaluar la red de colaboraciones de cada cineasta\n",
    "- Objetivo: Medir la cantidad de conexiones de cada cineasta."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Cineasta</th>\n",
       "      <th>NumColaboradores</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Juan Pérez</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Alejandro González</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Carla Mendoza</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Laura Fernández</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Roberto Díaz</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Elena Gutiérrez</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Carlos Méndez</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Valeria Soto</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Miguel Torres</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Cineasta  NumColaboradores\n",
       "0          Juan Pérez                 3\n",
       "1  Alejandro González                 2\n",
       "2       Carla Mendoza                 2\n",
       "3     Laura Fernández                 2\n",
       "4        Roberto Díaz                 2\n",
       "5     Elena Gutiérrez                 2\n",
       "6       Carlos Méndez                 2\n",
       "7        Valeria Soto                 2\n",
       "8       Miguel Torres                 1"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_num_colaboradores():\n",
    "    query = \"\"\"\n",
    "    MATCH (p:Person)-[:COLLABORATED_WITH]->(other)\n",
    "    RETURN p.name AS Cineasta, SIZE(COLLECT(other.name)) AS NumColaboradores\n",
    "    ORDER BY NumColaboradores DESC\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        num_colaboradores = [{\"Cineasta\": record[\"Cineasta\"], \"NumColaboradores\": record[\"NumColaboradores\"]} for record in result]\n",
    "        return num_colaboradores\n",
    "\n",
    "num_colaboradores = get_num_colaboradores()\n",
    "\n",
    "df_num_colaboradores = pd.DataFrame(num_colaboradores)\n",
    "df_num_colaboradores"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### **Investigación 9:** Medir la diversificación de los cineastas en géneros\n",
    "- Objetivo: Determinar cuántos géneros distintos ha explorado cada cineasta."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Cineasta</th>\n",
       "      <th>NumGenerosExplorados</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Juan Pérez</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Roberto Díaz</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Carlos Méndez</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Alejandro González</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Sofia Ramírez</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Carla Mendoza</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Miguel Torres</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Laura Fernández</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Elena Gutiérrez</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Cineasta  NumGenerosExplorados\n",
       "0          Juan Pérez                     3\n",
       "1        Roberto Díaz                     3\n",
       "2       Carlos Méndez                     3\n",
       "3  Alejandro González                     2\n",
       "4       Sofia Ramírez                     2\n",
       "5       Carla Mendoza                     2\n",
       "6       Miguel Torres                     2\n",
       "7     Laura Fernández                     2\n",
       "8     Elena Gutiérrez                     2"
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_num_generos_explorados():\n",
    "    query = \"\"\"\n",
    "    MATCH (p:Person)-[:DIRECTED]->(m:Movie)-[:BELONGS_TO]->(g:Genre)\n",
    "    RETURN p.name AS Cineasta, SIZE(COLLECT(DISTINCT g.name)) AS NumGenerosExplorados\n",
    "    ORDER BY NumGenerosExplorados DESC\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        num_generos_explorados = [{\"Cineasta\": record[\"Cineasta\"], \"NumGenerosExplorados\": record[\"NumGenerosExplorados\"]} for record in result]\n",
    "        return num_generos_explorados\n",
    "\n",
    "num_generos_explorados = get_num_generos_explorados()\n",
    "\n",
    "df_num_generos_explorados = pd.DataFrame(num_generos_explorados)\n",
    "df_num_generos_explorados"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
